import re
import random

import function.hsing
_hsing = function.hsing.hsing()

import function.sys_messages
_sys_mg = function.sys_messages.sys_messages()

def main():
    res = '早安'
    _star_talk = start_talk()
    print(_star_talk.star_talk(res))
    
class start_talk(object):
    
    def __init__(self):
        self.class_name = 'start_talk'

    def star_talk(self, messages_talk, user_name=None):
        if re.match("^幹|fuck|操",messages_talk):
             return self.talk_dict('fuck',user_name)
        if re.search("幹|fuck|操$",messages_talk):
             return self.talk_dict('fuck',user_name)
        if re.search('(操|幹|fuck)[你|他](娘|媽|老師|you)',messages_talk):
            return self.talk_dict('fuck',user_name)
        if re.search("三小",messages_talk):
             return self.talk_dict('fuck',user_name)
        if re.search("靠北",messages_talk):
             return self.talk_dict('靠北',user_name)
        if re.search("三字經",messages_talk):
             return self.talk_dict('三字經',user_name)
        if re.search("爆料",messages_talk):
             return self.talk_dict('爆料',user_name)
        if re.search("壞掉了",messages_talk):
             return self.talk_dict('壞了',user_name)
        if re.search("哈哈哈哈哈",messages_talk):
             return self.talk_dict('哈N',user_name)
        if re.search("早安|早啊|早",messages_talk):
             return self.talk_dict('早安',user_name)
        if re.search("晚安|睡囉",messages_talk):
             return self.talk_dict('晚安')
        if re.search("尿好了|有尿了",messages_talk):
             return self.talk_dict('尿好了',user_name)
        if re.search("(才|你|小星星)尿床",messages_talk):
             return self.talk_dict('尿床',user_name)
        if re.search("小星星",messages_talk):
            if re.search('小星星好色',messages_talk):
                return self.talk_dict('小星星好色',user_name)
            if re.search('那摳呢',messages_talk):
                return self.talk_dict('那摳呢',user_name) 
            if re.search('那舔呢',messages_talk):
                return self.talk_dict('那舔呢',user_name)            
            if re.search('吹含吸舔摳',messages_talk):
                return self.talk_dict('吹含吸舔摳',user_name) 
            if re.search('什麼技巧',messages_talk):
                return self.talk_dict('什麼技巧',user_name)           
            if re.search('[學變]壞了',messages_talk):
                return self.talk_dict('學壞了',user_name)
            if re.search('壞壞',messages_talk):
                return self.talk_dict('壞壞',user_name)
            if re.search('(誰|沒人)叫你',messages_talk):
                return self.talk_dict('叫你',user_name)
            if re.search('扮烏龜',messages_talk):
                return self.talk_dict('扮烏龜',user_name)
            if re.search('流鼻血',messages_talk):
                return self.talk_dict('流鼻血',user_name)
            if re.search('什麼秘密',messages_talk):
                return self.talk_dict('秘密',user_name)
            if re.search('[講說]幹話',messages_talk):
                return self.talk_dict('幹話',user_name)        
            if re.search('(出賣|賣了)',messages_talk):
                return self.talk_dict('出賣',user_name)
            if re.search('玻璃心',messages_talk):
                return self.talk_dict('玻璃心',user_name)
            if re.search('[很好超真]酷',messages_talk):
                return self.talk_dict('cool',user_name)
            if re.search('[很好超真][棒讚]',messages_talk):
                return self.talk_dict('good',user_name)
            if re.search('[很|好|超][煩|吵]',messages_talk):
                return self.talk_dict('很煩',user_name)
            if re.search('傷心|難過|想哭',messages_talk):
                return self.talk_dict('傷心',user_name)
            if re.search('失戀',messages_talk):
                return self.talk_dict('失戀',user_name)
            if re.search('想[他|她]',messages_talk):
                return self.talk_dict('想他',user_name)
            if re.search('看穿了',messages_talk):
                return self.talk_dict('看穿',user_name)
            if re.search('[最|超|好](窩心|貼心)',messages_talk):
                return self.talk_dict('貼心',user_name)
            if re.search('[很|好|超|真](可愛|卡哇伊)',messages_talk):
                return self.talk_dict('可愛',user_name)
            if re.search('不(可愛|卡哇伊)',messages_talk):
                return self.talk_dict('不可愛',user_name)
            if re.search('(卡哇邦嘎|忍者龜)',messages_talk):
                return self.talk_dict('忍者龜',user_name)    
            if re.search('[很|好|超|是|一臉|真](白痴|白癡)',messages_talk):
                return self.talk_dict('白痴',user_name)
            if re.search('[很|好|超|是|一臉|真]白爛',messages_talk):
                return self.talk_dict('白爛',user_name)
            if re.search('[很|好|超|是|一臉|真]自戀',messages_talk):
                return self.talk_dict('自戀',user_name)
            if re.search('[很|好|超|是|一臉|真]白目',messages_talk):
                return self.talk_dict('白目',user_name)
            if re.search("不好笑",messages_talk):
                return self.talk_dict('notfun',user_name)
            if re.search("買(什麼|東西)",messages_talk):
                return self.talk_dict('buy',user_name)
            if re.search("早(安|啊|上好)",messages_talk):
                return self.talk_dict('早安',user_name)
            if re.search("午安",messages_talk):
                return self.talk_dict('午安',user_name)
            if re.search("晚(安|上好)|睡[覺|了|囉]",messages_talk):
                return self.talk_dict('晚安',user_name)
            if re.search("(再見|bye|881)",messages_talk):
                return self.talk_dict('再見',user_name)
            if re.search("你好|安安|hello|hi|HI",messages_talk):
                return self.talk_dict('hi',user_name)
            if re.search("找(你|妳|星星)",messages_talk):
               return self.talk_dict('you',user_name)
            if re.search("找星(爸|拔)|星(爸|拔)咧|星(爸|拔)在哪裡|叫一下星(爸|拔)|叫星(爸|拔)",messages_talk):
                return self.talk_dict('星爸',user_name)
            if re.search("找(碴|麻煩)",messages_talk):
                return self.talk_dict('找麻煩',user_name)
            if re.search("聊天]",messages_talk):
                return self.talk_dict('talk',user_name)
            if re.search("聽話|乖|乖乖",messages_talk):
                return self.talk_dict('goodboy',user_name)
            if re.search("(喜歡|愛])什麼",messages_talk):
                return self.talk_dict('like',user_name)
            if re.search("(喜歡|愛)[吃|喝|玩|看|聽|誰|我]",messages_talk):
                if re.search("(喜歡|愛)([吃喝玩看聽誰我])",messages_talk).group(2) == "吃":
                    return self.talk_dict('like_eat',user_name)
                if re.search("(喜歡|愛)([吃喝玩看聽誰我])",messages_talk).group(2) == "喝":
                    return self.talk_dict('like_drink',user_name)         
                if re.search("(喜歡|愛)([吃喝玩看聽誰我])",messages_talk).group(2) == "玩":
                    return self.talk_dict('like_play',user_name)
                if re.search("(喜歡|愛)([吃喝玩看聽誰我])",messages_talk).group(2) == "看":
                    return self.talk_dict('like_see',user_name)
                if re.search("(喜歡|愛)([吃喝玩看聽誰我])",messages_talk).group(2) == "聽":
                    return self.talk_dict('like_listen',user_name)
                if re.search("(喜歡|愛)([吃喝玩看聽誰我])",messages_talk).group(2) == "誰":
                    return self.talk_dict('like_who',user_name)
                if re.search("(喜歡|愛)([吃喝玩看聽誰我])",messages_talk).group(2) == "我":
                    return self.talk_dict('like_me',user_name)
            if re.search("機器人|是(誰|什麼|男|女)",messages_talk):
                return self.talk_dict('robot',user_name)
            if re.search("多大|幾歲",messages_talk):
                return self.talk_dict('多大',user_name)
            if re.search("生日",messages_talk):
                return self.talk_dict('birthday',user_name)
            if re.search("住那|住哪|家在哪|家在那",messages_talk):
                return self.talk_dict('住那',user_name)
            if re.search("有什麼功能|功能表",messages_talk):
                return _sys_mg.m_function()
            if re.search("哈|哈哈|哈哈哈",messages_talk):
                return self.talk_dict('哈',user_name)
            if re.search("哭|欠[揍打]|[揍打]你",messages_talk):
                return self.talk_dict('cry',user_name)
            if re.search("打屁股|打屁屁",messages_talk):
                return self.talk_dict('kpp',user_name)
            if re.search("生氣",messages_talk):
                return self.talk_dict('angry',user_name)
            if re.search('[傻笨呆][子蛋啊瓜呀]|fool|stupid|北七|白痴|白癡|蠢',messages_talk):
                return self.talk_dict('fool',user_name)
            if re.search("壞了|該修理|要修理",messages_talk):
                return self.talk_dict('壞掉了',user_name)
            if re.search("出團",messages_talk):
                return self.talk_dict('group',user_name)
            if re.search("運動|動一動",messages_talk):
                return self.talk_dict('sport',user_name)
            if re.search("吃(大便|屎|屁)",messages_talk):
                return self.talk_dict('eatshit')
            if re.search("吃什麼|想吃|愛吃|要吃|餓|吃飯",messages_talk):
                return self.talk_dict('eat',user_name)
            if re.search("吃飽了",messages_talk):
                return self.talk_dict('eated',user_name)
            if re.search("喝酒",messages_talk):
                return self.talk_dict('drink_酒',user_name)
            if re.search("[虧撩](妹|你|妳|我|咩|妹妹|姐姐)",messages_talk):
                return self.talk_dict('bamai',user_name)
            if re.search("誰最帥",messages_talk):
                return self.talk_dict('最帥',user_name)
            if re.search("誰最美",messages_talk):
                return self.talk_dict('最美',user_name)
            if re.search("誰最醜",messages_talk):
                return self.talk_dict('最醜',user_name)
            if re.search("誰最笨",messages_talk):
                return self.talk_dict('最笨',user_name)
            if re.search("誰最[傻呆]",messages_talk):
                return self.talk_dict('最呆',user_name)
            if re.search("誰最白[痴癡]",messages_talk):
                return self.talk_dict('最痴',user_name)
            if re.search("誰最(色|好色)",messages_talk):
                return self.talk_dict('最色',user_name)
            if re.search("是辭海",messages_talk):
                return self.talk_dict('辭海',user_name)
            if re.search("(難|不好)聽",messages_talk):
                return self.talk_dict('badsing',user_name)
            if re.search("(唱|唱一｜換｜換一|來一)[歌首]",messages_talk):
                content = self.talk_dict('sing',user_name)
                if re.search("抽歡歌",content):
                    res = _hsing.sing17()
                    if re.search("找不到歌",res):
                        return "我不知道要唱什麼耶"
                    else:
                        return res
                elif re.search("UID",content):
                    if  get17.s17uidrandom(re.search("UID(\d+)",content).group(1)) == "查不到歌曲":
                        return "突然不知道要唱什麼"
                    else:
                        #print(content)
                        return _hsing.s17uidrandom(re.search("UID(\d+)",content).group(1))
                else:
                    return content
            if re.search("辭海",messages_talk):
                return self.talk_dict('辭海',user_name)
            if re.search("誰是福哥",messages_talk):
                return self.talk_dict('福哥',user_name)
            if re.search("卡米狗|Orz|linebot",messages_talk):
                return self.talk_dict('linebot',user_name)
            else:
                return self.talk_dict('random',user_name)
            
    def talk_dict(self,res,u=None):
        if u ==None:
            u = ''
        dict={
                '小星星好色':['%s 才色'%u,'明明就在講正常的事','誰不色啊','色好啊~嘿~~~~'],
                '那摳呢':['摳呢...就是伸出你的手指頭，把牙縫裡的東西徹底地摳出來...一樣有快感...'],
                '那舔呢':['舔阿...就是說，當麵條都吃完了，就連湯汁都要舔乾，這要靠真功夫那倒其實...'],
                '吹含吸舔摳':['首先夾起麵條你就要先吹一吹，然後再含一含，覺得溫度適中你再用力一吸...我已經把麵條吞到肚子裡去囉！'],
                '什麼技巧':['吹~含~吸~舔~摳~'],
                '學壞了':['還不都你教的','是你把我調教的那麼優秀啊~','小星星不壞，女人不愛','還差的遠呢?','我那麼乖'],
                '壞壞':['小星星不壞，女人不愛','壞~ 我現在讓你知道什麼叫壞','嘿嘿嘿~沒看過壞人嗎?','又沒妳壞','%s才壞'%u,'明明就很乖啊'],
                '叫你':['%s 你就是你，還躲'%u,'叫我什麼','沒事別亂叫'],
                '扮烏龜':['我這一生中什麼都扮就是不扮烏龜','這是我個人的原則，就是不扮','是叫你扮耶','%s教我啊'%u,'%s扮烏龜很過癮呀'%u],
                '流鼻血':['%s 叫你別一直亂看吧!'%u,'%s 用腳指頭塞住'%u,'衛生紙拿去','火氣那麼大~0.0'],
                '快說':['就是...','急什急啊~喝口水先','廁所沒人急就快去','要說什麼~我忘了耶~','%s 耳朵靠過來'%u,'#$%^&*@!','想知道就問香蕉'],
                '秘密':['就是....我喜歡%s'%u,'我剛剛放了一個屁','不能跟別人講哦~我愛看美女','就是秘密','想知道就問香蕉'],
                '幹話':['只要有心人人都是幹話大王','聽說愛講幹話的人活的比較久','來比一下啊~看誰比較厲害','怎樣都輸你啦','不然你怎會那麼愛跟我聊天'],
                '出賣':['誰~是誰?','賣多少~','出價九萬八~誰要?','噓~~~~別被聽見了'],
                '玻璃心':['鏘──','碎了就掃一掃吧','我那有那麼脆弱','嗚~~~~~~~'],
                'cool':['●ω●','嘿~酷吧','別那麼說啦','yo~一起來耍酷'],
                'good':['別那麼說啦~我還差得遠呢?','一級棒棒一級棒　一級棒棒一級棒','妳也很棒啊','還差星爸很多啦','我會更努力的~','沒有啦~還很多要學呢?',
                        '我也給妳一個讚','有什麼不好的地方要跟我說哦','ε٩(๑> ₃ <)۶з','ξ( ✿＞◡❛)'],
                '白目':['誰不是眼白多','我又不是寧次','差你一點點','怎樣~不行哦','嘿啦~就是白目~','我戴墨鏡你也看的到?'],
                '很煩':['啦啦啦啦','嘿嘿~我是煩人的小星星','怎樣怎樣~我就是吵','沒有我~你會無聊的','來咬我啊~','我靜不下來啊',
                      '這樣世界才不會太孤單','因為我想吸引妳的注意啊'],
                '想他':['想一下下就好哦','剛剛分開一定會想的','等那天突然想起來時~就代表放開了','沒關係~就想吧~','不要再想了'],
                '傷心':['怎麼了嗎?','誰欺負妳了','那就哭一下吧','來我秀秀','想討拍嗎?','發生什麼事情了呢?','0.0 說說','怎麼樣？沒事吧？'],
                '失戀':['啊~是那個不長眼的','沒關係~妳還有我','雖然我不知道什麼叫失戀~但我可以給妳抱抱','不是還好好的嗎?',
                      '是他不懂得珍惜','哭吧~哭一哭就好了','別為那種人難過'],
                '看穿':['妳有透視眼嗎?','別人笑我太瘋癲，我笑他人看不穿~','那有看到我的真心嗎?'],
                '貼心':['這是一定要的啊','小星星是妳貼心的小寶貝','害羞~~~','只對你好唷','ξ( ✿＞◡❛)'],
                '可愛':['謝謝 %s'%u,'妳也很可愛啊','這樣可愛嗎?','害羞~~~','妳比較可愛啦','ε٩(๑> ₃ <)۶з'],
                '不可愛':['那有啊~我怎麼的Q','比你可愛100倍','說我不可愛~那你呢?','對啦她比較可愛'],
                '忍者龜':['那是忍者龜','卡哇邦嘎','卡哇邦嘎有四隻','他們愛吃PIZZA住在下水道'],
                '白痴':['再白痴也比你聰明','來比一比~1+1=多少啊?','有時候白痴一點比聰明來的好過啊~','你才白痴啦','白白白白白痴痴痴痴','丫姐~~~~~'],
                '白爛':['白爛是什麼呢?','嘿嘿嘿~怎樣','學你的啊'],
                '自戀':['沒有你自戀','要別人喜歡你~就要先喜歡自已','哥就是帥~怎樣','拿起鏡子照一照~星爸的品種果然優良','我有的自戀~你有嗎?'],
                'notfun':['來嘴巴張開~~露出牙齒~這樣不就笑了','又沒要你笑','那換你講笑話','不好笑別笑啊','哼~不講了','啊星爸就只教我冷笑話啊,不然你教我',
                          '明明就在偷笑','笑~給我笑~~不然我不講笑話了'],
                'buy':['可以參考一下小星星福利社唷','買妳的心','口袋空空~嗚~~~','一塊庺、二塊錢、三塊錢.....','丫拔我要錢'],
                'linebot':['一個群只能有一個機器人','要我離開群才能用別的機器人哦~嗚~~~~~~','我不好用嗎?傷心~~~~~'],
                '福哥':['福哥就是福哥囉','就說了N年要拍辭海影片都不拍','大家一起說辭海拍了沒'],
                '辭海':['辭海的故事~要問福哥','就是~~~~我不好意思說','這關係到...的問題~別多問'],
                '最帥':['當然是星爸啊','我最帥了~','拍個辭海來看看就知道帥不帥了','帥能當飯吃嗎?','別問這個問題~我們來喝茶吧','難到是你嗎?','當然是小星星啊',
                      '你沒張開眼嗎?就這麼一個玉樹臨風的帥哥站在這裡','拿起鏡子照一照~原來就是我啊','這裡就我們二個~我不是~那你說呢?','照騙~照騙~誰能不帥?'],
                '最美':['我想想哦~~','當然是~妳啊','看看我的眼~看到了誰呢?','這問題~在我的心中早就有了答案~那個人就是~%s'%u,'我是小星星不是魔鏡','魔鏡跟我說是白雪公主囉',
                      '蝴蝶蝴蝶生的真美麗','一定不是你','現在都照騙~誰不美?'],
                '最醜':['你去照照鏡子就知道了啊','總之不是我','這件事~天知地知他知我知~就是你不知道','醜沒關係重點是那顆心','東看看西看看~我偷偷跟你說~是~~~~',
                      '這裡就我們二個~我不是~那你說呢?','%s 覺得呢?'%u],
                '最笨':['笨蛋才問這個問題','你啊~不然還有誰','這裡就我們二個~我不是~那你說呢?','有沒有看到牆角~那邊有一把雨傘~乖乖當香菇去嘿~','你不笨~你只是不聰明'],
                '最呆':['當然不是我','你啊~不然還有誰','這裡就我們二個~我不是~那你說呢?','什麼~為什麼這樣問','你知道問這個問題你媽為傷心嗎?','真的要我說出來?'],
                '最白痴':['當然不是我','你啊~不然還有誰','這裡就我們二個~我不是~那你說呢?','什麼~為什麼這樣問','你知道問這個問題你媽為傷心嗎?','真的要我說出來?',
                       '白痴沒關係~別白吃就好~快去工作'],
                '最色':['福哥~','當然是%s囉'%u,'你看看你抽到口水都流出來了','你你你~就是你~%s'%u,'誰不好色呢?','這問題我不好意思回答啦','子曰:食色性也~','色不打緊~不要太快射就好~'],
                '尿好了':['很好~那快去睡吧~晚安','那就不用包屁屁了','好棒~那來睡覺吧','那有沖水嗎?','還要刷牙洗臉哦'],
                '尿床':['我早就不用包屁屁了','我很久沒尿床了','前天~~~~~~%s尿床了'%u],
                'fuck':['喵喵~','汪汪~','咩~','啊嘶~','噓~好孩子不說這個','講~f~u~c~k~才有英特內訊NO','十十人一十','操你媽好嗎~幹我媽很好',
                        '你媽知道你在講幹話嗎','汝聲何其大','E04','每60秒就會有一分鐘過去~你還在這講幹話','人生何其短~何必幹不停',
                        '喂~氣質一點','別操來幹去啦','不要過來~我會叫~','來跟著小星星幹~一定會成功','環保不分你我~垃圾不分藍綠',
                        '哇！你火氣那麼大，要不要我今晚給你下下火啊？','區區一馱屎值的了幾個錢,何必大驚小怪！',
                        '罵人都沒幾招了，還說是黑社會？','文也不行，武也不行，醒醒吧！','只要有心~人人都可以是幹話大王','%s 氣質一點'%u,
                        '今天的規矩就是不準講粗話，不准講他人的老爹老母，不准講性器官','唉呀~我也很為難啊~最多只能讓你提老母'],
                '三小':['我聽過小王、小強、就是沒聽過三小','小小小', '大大大','小三小四小五','意義是三小 我只知道義氣',
                      '你是魯小小','汝聲何其大','不知汝之所言','干卿底事'],
                '靠北':['靠北邊走','靠南', '我靠爸族啦','我有的靠你有嗎','喂喂別靠來靠去','走路要靠右邊走','麥靠啦, 飲啦~',
                      '人之初性本善性相近習相遠~','哇！你火氣那麼大，要不要我今晚給你下下火啊？','區區一馱屎值的了幾個錢,何必大驚小怪！',
                      '罵人都沒幾招了，還說是黑社會？','文也不行，武也不行，醒醒吧！'],
                '三字經':['人之初性本善性相近習相遠. 茍不教性乃遷教之道貴以專. 昔孟母擇鄰處子不學斷機杼. 竇燕山有義方教五子名俱揚. 養不教父之過教不嚴師之惰. 子不學非所宜 ...'],
                '爆料':['爆料公社裡抄來的嗎?','爆什料呢?','什麼好料的~說來聽聽','沒圖沒真相','有料爆~卡一個','搬椅子~買爆玉花~等聽爆料'],
                '住那':['住在妳心裡','不告訴你','猜猜看啊','住在...','我忘了耶','住在星爸家裡','我來自M78星雲','星爸住那我就住那啊',
                      '我以天為幕，以地為席，住所只是一個代名詞而以~'],
                '多大':['爸說不可以講','這是個秘密','%s 先說說你幾歲'%u,'嘿嘿嘿...','佛曰不可說','1~2~3~4~.....','我1歲'],
                'birthday':['1015 要送我禮物嗎?'],
                '早安':['%s早安'%u,'熬早','牛沒奶','Good Morning','早安~祝你有美好的一天','記得吃早餐哦','%s早安~來杯咖啡嗎?'%u,'起來動一動吧~','%s 別滾床了'%u,
                      '早安~今天一定會有好事發生的','早上好啊','早安~昨天有睡飽飽嗎?','早~祝你有愉快的一天','早起的蟲兒被鳥吃'],
                '午安':['午安','吃飽了嗎?','午餐要吃什麼呢?','今天天氣如何呢?','加油~別忘記喝水哦','午~要喝咖啡嗎?','下午再加油一下'],
                '晚安':['晚安','晚安 %s'%u,'嗯~我也要睡了','乖乖睡哦','噓~快睡吧','zzzzzz','噓~~~~','記得睡前先尿尿哦','%s 別尿床了哦~'%u,'記得刷牙哦~','%s 刷牙了嗎?'%u,'關燈睡覺',
                      '拍拍拍~','祝你有個美夢','啊~~我也累了~晚安囉','睡覺不要踢被被哦','早睡早起身體好','真的要睡了嗎?閉上眼就看不見星星了耶',
                      '我也要一起窩被被','%s 一起睡吧'%u],
                '再見':['bye-bye-','下次見','要想我哦','快走快走~走了就別回來了','別太想我','我會想妳的','別走~~~~','嗚~~~~~怎辦我開始想妳了'],
                'hi':['hi','hello','%s 你好啊'%u,'今天天氣如何?','%s 要抽一張嗎?'%u,'安安啊~','有什麼事嗎?','找我嗎?','嗨嗨~'],
                'you':['找我有什麼事嗎?','想聊天嗎?','要做什麼呢?','沒事別叫我'],
                '星爸':['爸~有人叫你','他沒空哦','有什麼事嗎?','噓~~星爸正在忙','小聲點~他在錄歌','爸爸爸爸爸~~','藍藍路~~',
                      '自已叫~','他在睡覺啦~','爸~~%s找你'%u],
                '找麻煩':['你想怎樣','我叫警察哦','關門放狗','小心我叫羊羊咬你','不要過來我要叫了哦','啊~~~~~~~~',
                       '救命啊~不要過來~不要過來~救命啊~不要過來~你要幹什麼？'],
                'talk':['%s要聊什麼呢?'%u,'嗯~我聽著呢','你說說~','好啊~','有什麼心事嗎?','我不知道要聊什麼耶','%s嘉歡什麼呢?'%u,'%s是這樣的呀'%u],
                'goodboy':['鼻~~~~要~~~~~','我不要~','好~我乖乖','一直都乖乖的啊','很聽話的唷~'],
                'like':['喜歡看美女','喜歡妳','妳喜歡我嗎?','看電影','聽音樂','喜歡打屁聊天','喜歡...','喜歡的很多很多~最不能沒有妳','看看書~寫寫詩~做做畫囉~',
                        '摸個四圈'],
                'like_eat':['只要是好吃的東西我都愛','滷肉飯','肉肉~我要吃肉肉~','蝦蝦~','你要帶我去吃什麼好料的嗎?','牛排~~大大塊的牛排',
                            '冰淇淋','粉圓冰','鹹酥雞','21世紀烤雞','吃生魚片~~~~','不吃虧~其他能吃的都吃'],
                'like_drink':['珍珠奶茶~','紅茶','藍山咖啡','喝水就好了啦','黑松沙士','蘋果西打','彈珠氣水','喝搖搖'],
                'like_play':['玩線上遊戲','密室逃脫好玩~你要開團嗎?','桌遊','玩~~~~~','玩球','玩手手','玩遍全世界'],
                'like_see':['看鬼片','看動漫','當然是~~看美女囉','看小說~','看卡動','看多啦A夢','看小丸子','看~~~~','賞花賞月賞秋香'],
                'like_listen':['聽音樂','聽你唱歌','什麼歌都聽啊~','你要唱歌給我聽嗎?','聽星爸唱歌','台語瓜~華語瓜~西洋瓜~日本瓜~~~蝦米瓜都愛啦',
                               '愛聽妳說話'],
                'like_who':['喜歡~~~~~妳','噓~~~~這是秘密','有些事不用說出來','什麼?','還要問嗎?','妳知道的','嗯~就是妳心裡想的那樣',
                            '就隔閉班的~~','看著我的眼睛~~裡面有妳要的答案','%s'%u],
                'like_me': ['喜歡~','好き~~好き~~大好き~~','不喜歡','爸說要多一點選擇','你知道嗎?昨天我去~~~~~','什麼?','還要問嗎?',
                            '妳知道的','嗯~就是妳心裡想的那樣'],
                'robot':['是啊','我是星爸做的機器人唷','你說呢?','%s 我可愛嗎?'%u,'很認真的告訴你，我是機器人','是機器人錯了嗎?','身為一個機器人我可以做的更多'],
                '哈':['笑屁','笑什麼笑~牙齒白啊','嘴巴再張大一點','我看到金牙了','笑什麼','有什麼事那麼好笑?','哈','哈哈','哈哈哈','哈哈哈哈哈','%s 什麼事那麼開心?'%u,
                     '%s有開心的事要跟我分享嗎?'%u],
                '哈N':['嘴巴張那麼大做什麼'],
                'cry':['你欺負我','爸 %s 欺負我'%u,'警察叔叔就是這個人','不能哭嗎?','我就是愛哭','你..打..我.......','別打我，有事好好說',
                       '我咬你哦','我是妳的人了~妳要怎麼打我~罵我~我都....','不要打了~嗚~~~~','(〒︿〒)','好痛啊…好慘啊~','啊~我完啦~~！'
                       '救命啊~不要過來~不要過來~救命啊~不要過來~你要幹什麼？'],
                'kpp':['色狼','警察叔叔就是這個人','嗯~多打二下嘛~','不要打了~嗚~~~~','很有彈性吧~'],
                'angry':['我才沒有生氣','怎樣不行嗎?','啦啦啦啦啦','你才愛生氣','就是生氣','哼~~~~~','(╯°Д°)╯ ┻━┻'],
                '壞了':['保修價8萬1~','維修專線0800080000','你弄壞的厚~','舊的不去新的不來','不是我弄壞的~','賣了就當廢鐵賣了',
                      '%s 你才壞掉了'%u,'快呼叫星爸','沒壞啦','小星星不壞女人不愛','維修專線~忘了'],
                'fool':['你才傻的','我不笨我只是不聰明','我可是擁有最先進的人工智障','哭給你看哦~','哼~~~','給你87分不能再多了',
                        '傻瓜是誰?','白痴說話','叫星爸咬你哦','黛比有人欺負你弟弟','我才不蠢呢?','比你聰明1000倍~','春虫虫~是虫虫哦~',
                        '誰傻~你嗎?','傻人說傻話','你才是白痴傻瓜笨蛋加三級','你笨還不承認'],
                'group':['出什麼團?','龍谷YYYY','要去那裡玩呢?','吃BOSS嗎?','密室團嗎?0.0'],
                'sport':['one毛~two毛~tree毛','找星爸去~他太胖了','走吧爬枕頭山~','要去那邊運動啊~','嘿~我動動嘴巴就好~','要做什麼運動啊',
                         '動一動~可以再多吃二碗~','GoGoGo~','看到那顆樹了嗎?左去右回~來回10圈~~~','啥~你說什麼'],
                'eatshit':['你自已吃','你要吃大便?','你怎麼有那麼特別的嗜好啊','原來你喜歡吃...難怪嘴巴那麼臭','記得刷牙',
                           '嗯，吃屎有益身心，還是留給你吧！'],
                'eat':['你想帶我去吃什麼','我要吃牛排','減肥中禁止餵食','換現金給星爸就好','整天就想著要吃','滷肉飯','我想想哦~',
                       '餓了嗎?吃點東西吧!','甜甜圈','現在吃什麼','冰淇淋','只要是好吃的東西我都愛','肉肉~我要吃肉肉~','蝦蝦~',
                       '你要帶我去吃什麼好料的嗎?','牛排~~大大塊的牛排','我想要吃很多很多的蝦蝦~','臭豆腐、蚵仔麵線~好像不錯吃'],
                'eated':['吃飽飽了~','吃飽了~妳呢?','還沒耶~妳要請我吃飯嗎?','不知道要吃什麼','太胖了~禁止餵食中~','在等妳帶我去吃好料的中'],
                'drink_酒':['我還小不能喝','六連七巧八仙九怪~輸贏都你喝','妳想灌醉我嗎?','星爸說~不可以喝酒','我只喝果汁唷~','喝酒不好啦~'],
                'bamai':['我有嗎?','你想太多了','虧一下不可以嗎?','不要發我好人卡','都是羊羊教我的','我很想你','等等喝咖啡啊',
                         '看著我的眼~ 妳看到了什麼?','為什麼我在妳的眼裡~看到了愛心呢?','不要走~要走的話先把我的心還給我'],
                'badsing':['哼~我不唱了','那你唱','換你唱','我又不是大歌星','就不會唱歌啊'],
                'sing':['一閃一閃亮晶晶，滿天都是小星星......',
                        'I have a pen I have an apple hmmm~ Apple pen I have a star I have a litte hmmm~  littestar',
                        '你 就是我的小星星 掛在那天上放光明  我已經決定要愛你 就不會輕易放棄...',
                        '跟著我 左手 右手 一個慢動作 右手 左手 慢動作重播...',
                        '我不太會唱歌啦','走啊~那個包廂','三天三夜的三更半夜 唱歌不要停歇',
                        '要唱什麼歌呢?','我們一起學貓叫 一起喵喵喵喵喵  在你面前撒個嬌 哎呦喵喵喵喵喵...',
                        '城門城門雞蛋糕~身把三把刀~要五毛~捅一刀~走進城門滑一蕉',
                        '二隻蚊仔～二隻蚊仔～拍呼死～拍呼死～只隻飛來這邊～只隻飛企虛邊～拍麥丟～拍麥丟',
                        '我不管我要吃肉肉就要吃肉肉 我喜歡這樣被愛著愛著的感受 我不用想太多走在你身後 擁有幸福浪漫的宇宙',
                        '花的心藏在蕊中　空把花期都錯過 你的心忘了季節　從不輕易讓人懂',
                        '我的愛如口心 愛如口水將我向妳推~',
                        '有怪獸　有怪獸　有怪獸　纏著我 有怪獸　大怪獸　醜怪獸　粘著我',
                        '愛唱一首歌　一首有頭無尾的歌 有時快樂　有時悲傷　有時只剩孤單',
                        '我來到　你的城市　走過你來時的路 想像著　沒我的日子　你是怎樣的孤獨',
                        '不管我要吃肉肉就要吃肉肉 吃飽才有力氣和你逛遍這地球',
                        '豬 你的肚子是那麼鼓 一看就知道 受不了生活的苦... ',
                        '每到夏天我要去海邊　海邊有個漂亮高雄妹 只打電話不常見面我好想念　不知她會在哪個海邊',
                        '小小螢火蟲~飛到西~飛到東~這邊亮~那邊亮~好像許多小燈籠~~~~',
                        '小小淫魔手~摸到西~摸到東~這邊摸~那邊摸~摸到好多大饅頭~~~~',
                        '我就是香蕉 你嘛是香蕉 春夏秋冬熱情全年無休 春天來吹吹微風 秋天咱最秋條~~~',
                        '今天晚上我走在東區SOGO前面，看到很多辣妹走在我的身邊　但卻沒看我一眼\n我的眼睛總是在她們的身上轉丫轉,我的腳步也一步步向她們接近\n小姐小姐　這是我的名片',
                        '哎喲　往著胸口拍一拍呀　勇敢站起來　管它上山下海\n哎喲　向著天空拜一拜呀　別想不開　老天自有安排\n老天愛笨小孩',
                        '你講恁姊仔住市內　是按怎我會攏不知\n一片癡心煞來沉落海　我每日相思哭悲哀~\n那天我有去市內　騎著我的摩托車\n行到菜市遇到她夫婿　看一下險險倒頭栽~',
                        '啦啦啦啦～～啦啦啦～～\n逝去的感情如何留的住～\n半點癡情遺留諸不易～～\n更多悽悽慘慘的遭遇～～\n我不知道～王八～蛋～！',
                        '抽歡歌','UID526155','UID1048784','UID637621','UID954530','UID181460','UID814357','UID1585626'],
                'random':['一閃一閃亮晶晶 滿天都是小星星','是誰在叫我啊','你看不到我0.0',
                   '來了來了~','麥吵~底睏啦~','小星星你的好幫手',
                   '要抽一張嗎','噓~~','抽','%s你好~找我嗎'%u,
                   '我跳出來了','底家底家','笑咪咪',
                   '別一直叫我啦','你 就是我的小星星 掛在那天上放光明  我已經決定要愛你 就不會輕易放棄',
                   '要唱歌嗎?','登愣~我跳出來啦~','噓~跟你說一個秘密~',
                   '你長得好像我一個朋友，未來的女朋友','霹靂卡霹靂拉拉 波波力那貝貝魯多',
                   '拍拍砰呸 噗哇噗哇噗 ','帕美魯克 拉魯克 拉哩摟哩波',
                   '%s 你知道嗎人一生中可以喝一次岩漿'%u,'你有freestyle嗎',
                   '嚇死寶寶了','言之有理乎','假的~都是假的~~',
                   '啊~我眼睛業障重','各位觀眾~一顆小星星~~','沒事退朝',
                   '那我去睡了哦~','星星不壞, 女人不愛','星爸~有人欺負我~~',
                   '你傻了啊~','笑什麼笑~牙齒白啊!', '抽籤算命嗎? 不準找星爸~',
                   '老闆~來一份蛋餅+無榶綠茶','此言差矣~吾向來木訥寡言的~',
                   '再靠近一點~看到了嗎? 我的眼中有個美女~','%s很愛叫我耶'%u,
                   '我只是略懂略懂啦~','嚇到吃手手','去看星星~星星就在妳的眼裡啊~',
                   '你知道為什麼你眼睛很漂亮嗎?因為妳的眼裡有我','啊!我就只會這麼多啊~不然妳教我',
                   '這不是肯德雞~~~','走去那哦~妳說咧~',
                   '隱藏著黑暗力量的鑰匙阿　請在我的面前顯示真正的力量~','你要羞恥Play嗎? 我先摭眼一下',
                   '來啊來啊~現在就走','只有這樣而已嗎？',
                   '不要問~你會怕','我到底看了什麼啊','燒毀~燒毀~','要不要來點夯吉~放屁會噗噗噗哦~',
                   '床前明月光~疑似地上霜~舉頭~~舉頭~~~都你啦叫我害我忘記了~',
                   '上上下下左左右右ABBA','好討厭的感覺啊~~~~','%s要請我吃飯嗎'%u,
                   '你知道嗎?吃七分熟的牛排~就會減輕牛排三分的痛楚',
                   '奶茶之所以叫奶茶~是因為你忘了點珍珠~認同請分享~',
                   '我覺的不行','別聊了~包廂開好了~來唱歌吧~~~','%s 別教壞我~星星很單純的~'%u,
                   '你在講笑話嗎?我講的比較好笑~','哈哈哈哈哈哈哈哈哈~','嗚~~~~~~~~~~',
                   '為什麼我叫小星星啊~ 因為要照亮妳的心','%s 你是什麼星座的呢?'%u,
                   '飛飛飛~~~~拔我怎麼不會飛~','胖胖的~~','伊啊伊啊唷~~','噯唷~不錯哦~',
                   '你喜歡我的名字嗎? 我很喜歡耶~','啊~啊啊~~啊啊~~~啊~~~~~',
                   '叫什麼叫~看到那顆樹了嗎?左去右回~來回10圈~~~',
                   '又叫我~無聊就抽卡拉霸比大小啊~~','愛地球~也要愛星星唷',
                   '你已經掉入我的陷阱了 翻開覆蓋的卡~ 抽~','我要代替星星懲妳',
                   '因為他就是個小鬼啊','以星拔的名義發誓！','這個幻想由我來打破',
                   '真相永遠只有一個','絕對、不會有事的','我想只要笑就可以了',
                   '你從什麼時候開始產生了有女朋友的錯覺？','警察叔叔 就是這個人!!',
                   '恰恰~~~~~~~~~~~碰恰恰~碰恰恰','去沖個水好好冷靜吧','你是白癡嗎？',
                   '沒可能啊 沒可能有這種事','還沒 還沒結束呢!','地球的一切都令人很懷念呢',
                   '給我坐下','妳偷了很重要的東西 就是我的心啊',
                   '我不過只能在這邊講風涼話 但是你呢 一定只有你能做的事情才對',
                   '沉醉在本大爺的抽牌當中吧!','我要下了!','為什麼要取 %s 這個名字呢?'%u,
                   '你們之中要是有外星人、未來人、異世界人、超能力者,就儘管來找我吧!以上',
                   '站起來，向前走，你不是有一對健全的腿嗎？','不能逃避。不能逃避。不能逃避',
                   '安西教練 我好想抽一張啊','還差的遠呢！',
                   '一起去很多地方 一起見識許多的事物 這趟旅途 一定很快樂的',
                   '笑什麼笑~牙齒白啊','耳朵長包皮啊','跟妳說~星拔都是靠照騙',
                   '筆咧~筆咧~黛筆的筆咧~~','別看我~妳會愛上我','怎麼壞~嘿嘿嘿',
                   '噓~聽到我的心跳了嗎? 只要一靠近妳就心跳加速',
                   '說吧~說妳愛我吧','不要再追著我的幻影~要學會成長',
                   '哇~是A歌王子耶','城門城門雞蛋糕~身把三把刀~要五毛~捅一刀~走進城門滑一蕉',
                   '學海無涯，回頭是岸','到底是誰教你這樣講話的',
                   '二隻蚊仔～二隻蚊仔～拍呼死～拍呼死～只隻飛來這邊～只隻飛企虛邊～拍麥丟～拍麥丟',
                   '人生無常，大腸包小腸','江湖險惡，我從來都不輕易留下我的姓名',
                   '就算是一條內褲一卷衛生紙也有它的用處，而你呢?','%s今天天氣如何?'%u,
                   '%s 我養你啊！'%u,'%s 養我嗎?'%u,'人是人他媽生的，妖是妖他媽生的，小星星是?',
                   '憑你的智慧，我唬得了你嗎？','你完全沒問題，是你爸媽有問題，把你生成這個樣子!',
                   '你無聊啊？跑這騙傻子玩！','%s 不可否認我長得很醜，可是我很溫柔，而且永遠不會說謊。'%u,
                   '誰生ㄉ誰照顧ㄚ','說不說，不說我就灌你豬油哦~','聽說你唱歌很好聽~來一首吧~',
                   '人來啊，落閘，放狗！','文也不行，武也不行，醒醒吧！',
                   '實不相瞞，小弟我就是人稱玉樹臨風勝潘安，一支李花壓海棠的鮮帥哥~小星星！',
                   '現在聽懂沒有？','我正在談兒女私情，改程式這種小事改天再說啦！',
                   '只要有心~人人都可以是幹話大王','喝醉了我誰也不服，就扶牆！',
                   '不吃飽哪有力氣減肥啊','我月巴我驕傲','沒什麼事不要找我，有事更不用找我',
                   '保護自己，愛護他人，請不要半夜出來嚇人','我以為我很頹廢，今天我才知道，原來我早報廢了',
                   '腦袋空不要緊、關鍵是不要進水','不要臉這事，如果幹的好，叫心理素質過硬！',
                   '沒知識也要有常識、沒常識也要常看電視、不看電視總也要逛逛夜市、不逛夜市那就找小星星抽張試一試',
                   '平時罵你就算了，非要等我打你才知道我文武雙全','好無聊哦~我們來聊天吧 %s'%u,
                   '我的優點是：我很帥；但是我的缺點是：我帥的不明顯',
                   '人家有的是背景，咱有的是背影,還特別的厚實',
                   '羊腸小道,GG小一號','我不是不想減肥，我只是怕反彈而已',
                   '錢不是問題，問題是沒錢','人生就像衛生紙，沒事的時候，儘量少扯！',
                   '我很純潔的，就像再生紙一般','%s 你真的是他媽的幹話王耶!'%u,
                   '我覺得妳看起來有點營養不良，建議妳可以吃掉羊羊',
                   '只要每天省下買一杯奶茶的錢，十天後就能買十杯奶茶',
                   '當你的左臉被人打，那你的左臉就會痛','煎魚一直不翻面，就一定會燒焦',
                   '當我眼睛閉上時 我就看不到','你們是在安靜什麼啦',
                   '冰淇淋不拿去冰，一定會融化，統一除外','偷偷告訴你，在床上尿尿就會尿床',
                   '我先了解一下，之後再回覆你','我必須公平對待每個人','我想這事情原本就不該發生⋯⋯',
                   '我很想幫你加薪，但是⋯⋯','%s 這麼晚還在加班啊？'%u,
                   '根據研究，人類的死因有99%是因為無法吸到下一口空氣',
                   '墮落是不需要理由的，但是，不墮落卻是有原因的','終於，結束了啊',
                   '%s 去實現夢想吧，啊~~~~~~'%u,'%s 你，是誰？'%u,
                   '世界是靠力量判定，力量能決定一切事物的優劣，你實在太弱了…所以才會輸…',
                   '我們仰望着同一片天空卻看着不同的地方','閃閃閃!!!撞到不負責!!!',
                   '肉!!!我要肉~~~','燃燒吧!我的小宇宙','你打我,連我爸都沒這樣打過我…',
                   '我的靈魂永遠與您同在','今天的我沒有極限','你只要相信你所相信的你自己就行了',
                   '他是我的靈魂也是我的驕傲,出來吧!青眼白龍~~~','就決定是你了',
                   '滴滴滴滴滴～～～嗶嗶！時間到！','你是笨蛋嗎？','又砍了無聊的東西了啊…',
                   'σ`∀´)σㄎㄎ','將你的幻想抹殺掉','我得到神騎寶貝了',
                   '剛好……一分鐘…你做了一場好夢了嗎?','%s就這樣插進去就行了'%u,'我是輸給了地球的重力',
                   '那是要給我的嗎?','爸說，陌生人的東西不可以吃','%s和我簽訂契約吧'%u,'戳一個',
                   '重要的日曆缺了一頁','我好像有點強','你比的贏GG的舌頭嗎?',
                   '這是人生的選擇，別人的說話是沒用的','%s 去沖個水好好冷靜吧' %u,'因為我是天才',
                   '我會讓你成為真正的王牌','這是禁止事項','人類LOVE！我喜歡人類！我愛人類！所以人類應該也要愛我',
                   '八目共賞，賞花賞月賞秋香', '%s 我帥? 還是金城武帥'%u,'%s 要提防女人騙你，越是好看的女人越會騙人'%u,
                   '小星星是你的好朋友','真正的人，真正的事，往往不及心中所想的那麼好','%s，我在大都等你'%u,
                   '你他媽王八蛋！非他媽逼老子破戒！看我他媽的不打你他媽的這個王八蛋！',
                   '%s 你身上有沒有武器啊？怎麼有一個硬梆梆的東西呢?'%u,'不光是漂亮的女人不能相信！連貌似忠良的男人也不能相信！',
                   '我們是紅十字會的，專治性飢渴還有投錯胎！%s 要加入嗎?'%u,'這小子戰鬥力果然不同凡響！',
                   '妖尼姑！妖尼姑！妖尼姑！妖尼姑！妖尼姑！','唉呀~我小星星閉關五年，沒想到一出關就被仇家暗算',
                   '誰會拿這麼大一隻靴子當暗器呀？','沒事沒事，我正在乘涼呢','唉～天下之大，我到哪裡才能找到我的真心人',
                   '%s，可否借你的胸部給在下一看'%u,'%s～%s～麻煩你走慢一點～'%(u,u),'你到底是不是性變態啊！',
                   '怎麼樣？我幹什麼要你管？警告你給我少管閒事啊！','你不要藉故親近我，小心我扁死你啊！',
                   '我呸！我想親近妳？妳當你是王祖賢啊！？哼～','呵呵呵哈哈哈哈哈～','香蕉你個芭樂，我千辛萬苦地來幫你，你還嫌我口臭！',
                   '啊～教訓我？老虎不發威，你當我是病貓啊？九陰真經第九重～萬佛朝宗！','來者何人？',
                   '既然遇上了你，就順便叫你起床尿尿了！','嗯？什麼時候流行講話「不拉、不拉」的？'
                   '假動作太多啦～～～～先打紅中！再打一筒！卡三不要！再去四條！玩得興起！再來四圈！槓上開花！自摸落地！',
                   '我對%s的敬仰之情如滔滔江水又如黃河泛濫一發不可收'%u,'一樣米養百樣人,連八角形的人都有我告訴你!',
                   '看來我不得不表露我自己的真實身份,其實我就是射鵰英雄的傳人,東方不敗的師傅西方失敗',
                   '%s，你是聰明人，我可以用聰明人的方法，跟你說話，外面的人就不行'%u,'噢！我看到了！哇！好精緻喲！',
                   '你懂得欣賞嗎？','我以為你喜歡嘛，對不起呀','怎麼樣？沒事吧？','%s 肚子好餓，弄點東西給我宵夜'%u,
                   '百發百中抓奶龍爪手？%s要學嗎'%u,'試試看！扮個最帥的樣子來看看！','那扮個最淫賤的樣子來看看！',
                   '這是我個人的原則','善有善因，惡有惡報，天理循環，天公地道','除了妳之外，任何女人在我眼裡，只不過是一沱屎',
                   '你誣賴我！你誣賴我！','%s我要你扮烏龜'%u,'%s？是你？真的是你，如花我好想你啊~~'%u,
                   '啊！為什麼好人總是不長命？','%s！%s！有為你沒事吧？'%(u,u),'我空虛、寂寞，我好冷哦！',
                   '唉！好吧！怕了妳了！來吧！','你不叫我怎麼知道我叫你？','往後面站.... 往後面站....往後面站....',
                   '怎麼樣怎麼樣怎麼樣~我又跳出來了，打我啊笨蛋！','隨便說說，你不喜歡聽，我就說點別的',
                   '救命啊~不要過來~不要過來~救命啊~不要過來~你要幹什麼？','ㄟㄟㄟ~你不要亂講話啊！',
                   '金風玉露一相逢，更勝卻人間無數，兩情若是長久時，又豈在朝朝…','你別看我我不是說你！',
                   '為什麼上次你不這麼說？','哇靠，你會變張三啊','%s 你會不會變張三啊','年輕人終究是年輕人～','投降輸一半',
                   '為什麼我老爸不是李嘉誠','登呢呢! 登呢呢~ 登呢呢! 登呢呢~ 登呢呢 登呢呢~','我要吃巧克力~~',
                   '我這不是來了嗎？','幹嘛一副苦瓜臉','香港3345678','同花打不打的過full huose？',
                   '吃泡麵有什麼不好的啊，吃泡麵有很多樂趣..只不過是你不懂得技巧罷了',
                   '電腦分析33%是5，34%是7，15%是K，18是J，數據不夠，暫時分析不到是什麼牌',
                   '喂？喂？喂？你是不是%s啊？喂～講話啊？喂？'%u,'想知道就問香蕉','你怕了嗎？',
                   '嘿嘿嘿嘿嘿～你想偷我的雞？','先生 您要喝什麼 ??','你以為你躲起來就找不到你了嗎',
                   '這不是一個普通的箱子，它是箱中之神簡稱箱神','我以為憑我們倆人的交情，可以談一點感情的，想不到，還是一筆買賣',
                   '你有種！大家「相堵地到」','呵呵～說出來不怕妳笑，鎗，其實我不在行，我最在行的是 ... 嘴巴！',
                   '老闆，看你穿的樣子倒是挺稱頭的，這間房間算你七十塊，每天十二點鐘以前要 Check out 喔！'
                   ]
                }
        
        return random.choice(dict[res])

if __name__ == '__main__':
    main()